app/controllers/books_controller.rb

INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "a"], ["created_at", "2021-04-03 08:33:49.759125"], ["updated_at", "2021-04-03 08:33:49.759125"], ["title", "テスト"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book), notice: "successfully created book!"
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "sd"], ["updated_at", "2021-04-03 11:05:34.480298"], ["id", 2]]
---
  def update
    p "aaaaaaaaaa"
    @book = Book.find(params[:id])
    if @book.update(book_params)